Autodesk.Revit.DB.Mechanical.IDuctFittingAndAccessoryPressureDropServer.GetDataSchema
Obtains the schema of the ESEntity.
Returns:
Null if the server has no data.
Since:
2014

Autodesk.Revit.DB.Mechanical.IDuctFittingAndAccessoryPressureDropServer.IsApplicable(Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropData)
Check if the server is applicable for the duct fitting or duct accessory.
data:
The input data of the calculation.
Since:
2014

Autodesk.Revit.DB.Mechanical.IDuctFittingAndAccessoryPressureDropServer.Calculate(Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropData)
Calculate the duct fitting and duct accessory coefficient.
data:
The input and output data of the calculation.
Returns:
True if calculation succeeds.
False if calculation fails.
Since:
2014

Autodesk.Revit.DB.Mechanical.IDuctFittingAndAccessoryPressureDropServer
Interface class for external servers implementing duct fitting and duct accessory coefficient calculation.
Remarks:
A typical way to use the external server can be:
Implement a server class that derives from this interface Create a new server object and register it with the service, see ExternalServiceRegistry.Assign server to duct fitting instance.
Since:
2014